# โจทย์: ระบบตรวจสอบตัวเลขว่าเป็นเลขคู่หรือเลขคี่ โดยรับข้อมูลตัวเลขจำนวนเต็ม 1 ตัวและแสดงผลลัพธ์ว่าเป็น "เลขคู่" หรือ "เลขคี่"

# **โจทย์จากค่ายคอมพิวเตอร์ bootcamp KMUTNB**

num = int(input("กรุณากรอกตัวเลขจำนวนเต็ม 1 ตัว: ")) # รับค่าตัวเลขจำนวนเต็ม 1 ตัว (ได้ทั้งเเค่จำนวนเต็ม)
Result = num % 2
if Result == 0:
  print("เลขคู่")            # ถ้า ตัวเลขที่รับเข้ามาหารด้วย 2 ลงตัว ให้แสดงผลลัพธ์ว่า "เลขคู่"
else:
  print("เลขคี่")            # ถ้า ตัวเลขที่รับเข้ามาหารด้วย 2 ไม่ลงตัว ให้แสดงผลลัพธ์ว่า "เลขคี่"




                                                                            # Lab 1: Hello - Python :L2
                                                                            # นักศึกษา: นายพชรพล ชนะศรี
                                                                            # รหัสประจำตัว: 6901012610170
