# โจทย์: คำนวณราคาตั๋วเข้าชมภาพยนตร์ตามเกณฑ์อายุผู้ใช้งาน:
# เด็กอายุต่ำกว่า 12 ปี หรือ ผู้สูงอายุ 60 ปีขึ้นไป: ดูฟรี!
# วัยรุ่นอายุ 12-18 ปี: ราคา 100 บาท
# บุคคลทั่วไป: ราคา 200 บาท

# **โจทย์จากค่ายคอมพิวเตอร์ bootcamp KMUTNB**

age = int(input("กรุณากรอกอายุของคุณ: "))  # กรอกอายุผู้ใช้งาน (ได้ทั้งเเค่จำนวนเต็ม)

if age < 12 or age >= 60 :
    print("ดูฟรี!")                        # ถ้า อายุผู้ใช้งานน้อยกว่า 12 ปี หรือ มากกว่าหรือเท่ากับ 60 ปี ให้แสดงผลลัพธ์ว่า "ดูฟรี!"
elif age >= 12 and age <= 18:
    print("ราคา 100 บาท")                # ถ้า อายุผู้ใช้งานมากกว่าหรือเท่ากับ 12 ปี และ น้อยกว่าหรือเท่ากับ 18 ปี ให้แสดงผลลัพธ์ว่า "ราคา 100 บาท"
else:
    print("ราคา 200 บาท")                # ถ้า อายุผู้ใช้งานมากกว่า 18 ปี และ น้อยกว่า 60 ปี ให้แสดงผลลัพธ์ว่า "ราคา 200 บาท"




                                                                            # Lab 1: Hello - Python :L2
                                                                            # นักศึกษา: นายพชรพล ชนะศรี
                                                                            # รหัสประจำตัว: 6901012610170

