# 1. SyntaxError: invalid syntax (ข้อผิดพลาดทางไวยากรณ์)
# แก้ไข: ตรวจสอบให้แน่ใจว่าโค้ดของคุณถูกต้องตามไวยากรณ์ของภาษา Python และไม่มีข้อผิดพลาดทางไวยากรณ์ เช่น การลืมปิดวงเล็บหรือเครื่องหมายคำพูด

# 2. IndentationError: expected an indented block (ข้อผิดพลาดจากการย่อหน้า)
# แก้ไข: ตรวจสอบให้แน่ใจว่าย่อหน้าโค้ดถูกต้องตามมาตรฐานของ Python โดยใช้การเว้นวรรคหรือแท็บที่เหมาะสม

# 3. NameError: name 'variable_name' is not defined (ข้อผิดพลาดจากการเรียกใช้ตัวแปรที่ไม่ได้ประกาศ)
# แก้ไข: ตรวจสอบให้แน่ใจว่าตัวแปรที่เรียกใช้ถูกประกาศและกำหนดค่าแล้วก่อนที่จะใช้งาน



                                                                            # Lab 1: Hello - Python :L2
                                                                            # นักศึกษา: นายพชรพล ชนะศรี
                                                                            # รหัสประจำตัว: 6901012610170