# คํานวณพื้นที่ของที่ดินรูปสี่เหลี่ยม จากความกว้างและความยาว (หน่วยเป็นเมตร) แสดงพื้นที่ในหน่วยตารางเมตร และตารางวา
W = int(input("Enter the width meters: "))  # รับค่าความกว้าง (หน่วยเป็นเมตร)
L = int(input("Enter the length meters: "))  # รับค่าความยาว (หน่วยเป็นเมตร)
Area_meter = W * L  # คำนวณพื้นที่ในหน่วยตารางเมตร
Area_wa = Area_meter / 4  # แปลงพื้นที่เป็นตารางวา
print(f"Area is: {Area_meter:.2f} square meters")  # แสดงผลลัพธ์พื้นที่ในหน่วยตารางเมตร (เเสดงเเค่ทศนิยม 2 ตำแหน่ง)
print(f"Area is: {Area_wa:.2f} square wa")  # แสดงผลลัพธ์พื้นที่ในหน่วยตารางวา (เเสดงเเค่ทศนิยม 2 ตำแหน่ง)